package java_seminars.Seminar2;

// Напишите метод, который составит строку, состоящую из 100 повторений слова TEST и метод, 
// который запишет эту строку в простой текстовый файл, обработайте исключения.
public class Ex4 {
    public static void main(String[] arg) {
        int[] array = new int[] { 513, 21, 33, 5 };
        System.out.println(array[array.length-1]);
    }
}
